#### Terraform Format and Style 🖌`failure`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
module.resource_group.azurerm_resource_group.this: Refreshing state... [id=/subscriptions/079ab1f2-9528-44da-ba22-d60a88fdb0b8/resourceGroups/eco-dev-rg]
module.log_analytics.azurerm_log_analytics_workspace.this: Refreshing state... [id=/subscriptions/079ab1f2-9528-44da-ba22-d60a88fdb0b8/resourceGroups/eco-dev-rg/providers/Microsoft.OperationalInsights/workspaces/eco-dev-law]
module.network.azurerm_virtual_network.this: Refreshing state... [id=/subscriptions/079ab1f2-9528-44da-ba22-d60a88fdb0b8/resourceGroups/eco-dev-rg/providers/Microsoft.Network/virtualNetworks/eco-dev-vnet]
module.acr.azurerm_container_registry.this: Refreshing state... [id=/subscriptions/079ab1f2-9528-44da-ba22-d60a88fdb0b8/resourceGroups/eco-dev-rg/providers/Microsoft.ContainerRegistry/registries/ecodevacr]
module.network.azurerm_subnet.this["aks"]: Refreshing state... [id=/subscriptions/079ab1f2-9528-44da-ba22-d60a88fdb0b8/resourceGroups/eco-dev-rg/providers/Microsoft.Network/virtualNetworks/eco-dev-vnet/subnets/eco-dev-aks-snet]
module.network.azurerm_subnet.this["containerapps"]: Refreshing state... [id=/subscriptions/079ab1f2-9528-44da-ba22-d60a88fdb0b8/resourceGroups/eco-dev-rg/providers/Microsoft.Network/virtualNetworks/eco-dev-vnet/subnets/eco-dev-apps-snet]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.aks.azurerm_kubernetes_cluster.this will be created
  + resource "azurerm_kubernetes_cluster" "this" {
      + api_server_authorized_ip_ranges     = (known after apply)
      + azure_policy_enabled                = true
      + current_kubernetes_version          = (known after apply)
      + dns_prefix                          = "eco-dev-aks"
      + fqdn                                = (known after apply)
      + http_application_routing_zone_name  = (known after apply)
      + id                                  = (known after apply)
      + image_cleaner_enabled               = false
      + image_cleaner_interval_hours        = 48
      + kube_admin_config                   = (sensitive value)
      + kube_admin_config_raw               = (sensitive value)
      + kube_config                         = (sensitive value)
      + kube_config_raw                     = (sensitive value)
      + kubernetes_version                  = "1.31.2"
      + location                            = "eastus"
      + name                                = "eco-dev-aks"
      + node_resource_group                 = (known after apply)
      + node_resource_group_id              = (known after apply)
      + oidc_issuer_url                     = (known after apply)
      + portal_fqdn                         = (known after apply)
      + private_cluster_enabled             = false
      + private_cluster_public_fqdn_enabled = false
      + private_dns_zone_id                 = (known after apply)
      + private_fqdn                        = (known after apply)
      + public_network_access_enabled       = true
      + resource_group_name                 = "eco-dev-rg"
      + role_based_access_control_enabled   = true
      + run_command_enabled                 = true
      + sku_tier                            = "Free"
      + support_plan                        = "KubernetesOfficial"
      + tags                                = {
          + "Environment" = "dev"
          + "Owner"       = "platform-team"
          + "Project"     = "ecommerce-microservices"
        }
      + workload_identity_enabled           = false

      + default_node_pool {
          + enable_auto_scaling  = true
          + kubelet_disk_type    = (known after apply)
          + max_count            = 5
          + max_pods             = (known after apply)
          + min_count            = 1
          + name                 = "default"
          + node_count           = (known after apply)
          + node_labels          = (known after apply)
          + orchestrator_version = (known after apply)
          + os_disk_size_gb      = (known after apply)
          + os_disk_type         = "Managed"
          + os_sku               = (known after apply)
          + scale_down_mode      = "Delete"
          + tags                 = {
              + "Environment" = "dev"
              + "Owner"       = "platform-team"
              + "Project"     = "ecommerce-microservices"
            }
          + type                 = "VirtualMachineScaleSets"
          + ultra_ssd_enabled    = false
          + vm_size              = "Standard_B4ms"
          + vnet_subnet_id       = "/subscriptions/079ab1f2-9528-44da-ba22-d60a88fdb0b8/resourceGroups/eco-dev-rg/providers/Microsoft.Network/virtualNetworks/eco-dev-vnet/subnets/eco-dev-aks-snet"
          + workload_runtime     = (known after apply)
        }

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }

      + network_profile {
          + dns_service_ip          = "10.0.0.10"
          + docker_bridge_cidr      = (known after apply)
          + ebpf_data_plane         = (known after apply)
          + ip_versions             = (known after apply)
          + load_balancer_sku       = "standard"
          + network_data_plane      = (known after apply)
          + network_mode            = (known after apply)
          + network_plugin          = "azure"
          + network_policy          = "azure"
          + outbound_ip_address_ids = (known after apply)
          + outbound_ip_prefix_ids  = (known after apply)
          + outbound_type           = "loadBalancer"
          + pod_cidr                = (known after apply)
          + pod_cidrs               = (known after apply)
          + service_cidr            = "10.0.0.0/16"
          + service_cidrs           = (known after apply)
        }

      + oms_agent {
          + log_analytics_workspace_id = "/subscriptions/079ab1f2-9528-44da-ba22-d60a88fdb0b8/resourceGroups/eco-dev-rg/providers/Microsoft.OperationalInsights/workspaces/eco-dev-law"
          + oms_agent_identity         = (known after apply)
        }
    }

  # module.aks.azurerm_role_assignment.aks_acr will be created
  + resource "azurerm_role_assignment" "aks_acr" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "AcrPull"
      + scope                            = "/subscriptions/079ab1f2-9528-44da-ba22-d60a88fdb0b8/resourceGroups/eco-dev-rg/providers/Microsoft.ContainerRegistry/registries/ecodevacr"
      + skip_service_principal_aad_check = true
    }

  # module.container_apps["api-gateway"].azurerm_container_app.this will be created
  + resource "azurerm_container_app" "this" {
      + container_app_environment_id  = (known after apply)
      + custom_domain_verification_id = (sensitive value)
      + id                            = (known after apply)
      + latest_revision_fqdn          = (known after apply)
      + latest_revision_name          = (known after apply)
      + location                      = (known after apply)
      + name                          = "eco-dev-api-gateway"
      + outbound_ip_addresses         = (known after apply)
      + resource_group_name           = "eco-dev-rg"
      + revision_mode                 = "Single"
      + tags                          = {
          + "Environment" = "dev"
          + "Owner"       = "platform-team"
          + "Project"     = "ecommerce-microservices"
        }

      + ingress {
          + allow_insecure_connections = false
          + external_enabled           = true
          + fqdn                       = (known after apply)
          + target_port                = 8080
          + transport                  = "auto"

          + traffic_weight {
              + latest_revision = true
              + percentage      = 100
            }
        }

      + registry {
          + password_secret_name = "acr-password"
          + server               = "ecodevacr.azurecr.io"
          + username             = "ecodevacr"
        }

      + secret {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }

      + template {
          + max_replicas    = 2
          + min_replicas    = 1
          + revision_suffix = (known after apply)

          + container {
              + cpu               = 0.5
              + ephemeral_storage = (known after apply)
              + image             = "ecodevacr.azurecr.io/api-gateway:v0.1.0"
              + memory            = "1Gi"
              + name              = "eco-dev-api-gateway"

              + env {
                  + name  = "CONFIG_SERVER_URL"
                  + value = "https://cloud-config.dev.internal"
                }
              + env {
                  + name  = "SPRING_PROFILES_ACTIVE"
                  + value = "dev"
                }
            }
        }
    }

  # module.container_apps["cloud-config"].azurerm_container_app.this will be created
  + resource "azurerm_container_app" "this" {
      + container_app_environment_id  = (known after apply)
      + custom_domain_verification_id = (sensitive value)
      + id                            = (known after apply)
      + latest_revision_fqdn          = (known after apply)
      + latest_revision_name          = (known after apply)
      + location                      = (known after apply)
      + name                          = "eco-dev-cloud-config"
      + outbound_ip_addresses         = (known after apply)
      + resource_group_name           = "eco-dev-rg"
      + revision_mode                 = "Single"
      + tags                          = {
          + "Environment" = "dev"
          + "Owner"       = "platform-team"
          + "Project"     = "ecommerce-microservices"
        }

      + ingress {
          + allow_insecure_connections = false
          + external_enabled           = false
          + fqdn                       = (known after apply)
          + target_port                = 8888
          + transport                  = "auto"

          + traffic_weight {
              + latest_revision = true
              + percentage      = 100
            }
        }

      + registry {
          + password_secret_name = "acr-password"
          + server               = "ecodevacr.azurecr.io"
          + username             = "ecodevacr"
        }

      + secret {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }

      + template {
          + max_replicas    = 2
          + min_replicas    = 1
          + revision_suffix = (known after apply)

          + container {
              + cpu               = 0.5
              + ephemeral_storage = (known after apply)
              + image             = "ecodevacr.azurecr.io/cloud-config:v0.1.0"
              + memory            = "1Gi"
              + name              = "eco-dev-cloud-config"

              + env {
                  + name  = "CONFIG_SERVER_URL"
                  + value = "https://cloud-config.dev.internal"
                }
              + env {
                  + name  = "SPRING_PROFILES_ACTIVE"
                  + value = "dev"
                }
            }
        }
    }

  # module.container_apps["favourite-service"].azurerm_container_app.this will be created
  + resource "azurerm_container_app" "this" {
      + container_app_environment_id  = (known after apply)
      + custom_domain_verification_id = (sensitive value)
      + id                            = (known after apply)
      + latest_revision_fqdn          = (known after apply)
      + latest_revision_name          = (known after apply)
      + location                      = (known after apply)
      + name                          = "eco-dev-favourite-service"
      + outbound_ip_addresses         = (known after apply)
      + resource_group_name           = "eco-dev-rg"
      + revision_mode                 = "Single"
      + tags                          = {
          + "Environment" = "dev"
          + "Owner"       = "platform-team"
          + "Project"     = "ecommerce-microservices"
        }

      + ingress {
          + allow_insecure_connections = false
          + external_enabled           = false
          + fqdn                       = (known after apply)
          + target_port                = 8086
          + transport                  = "auto"

          + traffic_weight {
              + latest_revision = true
              + percentage      = 100
            }
        }

      + registry {
          + password_secret_name = "acr-password"
          + server               = "ecodevacr.azurecr.io"
          + username             = "ecodevacr"
        }

      + secret {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }

      + template {
          + max_replicas    = 2
          + min_replicas    = 1
          + revision_suffix = (known after apply)

          + container {
              + cpu               = 0.5
              + ephemeral_storage = (known after apply)
              + image             = "ecodevacr.azurecr.io/favourite-service:v0.1.0"
              + memory            = "1Gi"
              + name              = "eco-dev-favourite-service"

              + env {
                  + name  = "CONFIG_SERVER_URL"
                  + value = "https://cloud-config.dev.internal"
                }
              + env {
                  + name  = "SPRING_PROFILES_ACTIVE"
                  + value = "dev"
                }
            }
        }
    }

  # module.container_apps["order-service"].azurerm_container_app.this will be created
  + resource "azurerm_container_app" "this" {
      + container_app_environment_id  = (known after apply)
      + custom_domain_verification_id = (sensitive value)
      + id                            = (known after apply)
      + latest_revision_fqdn          = (known after apply)
      + latest_revision_name          = (known after apply)
      + location                      = (known after apply)
      + name                          = "eco-dev-order-service"
      + outbound_ip_addresses         = (known after apply)
      + resource_group_name           = "eco-dev-rg"
      + revision_mode                 = "Single"
      + tags                          = {
          + "Environment" = "dev"
          + "Owner"       = "platform-team"
          + "Project"     = "ecommerce-microservices"
        }

      + ingress {
          + allow_insecure_connections = false
          + external_enabled           = false
          + fqdn                       = (known after apply)
          + target_port                = 8083
          + transport                  = "auto"

          + traffic_weight {
              + latest_revision = true
              + percentage      = 100
            }
        }

      + registry {
          + password_secret_name = "acr-password"
          + server               = "ecodevacr.azurecr.io"
          + username             = "ecodevacr"
        }

      + secret {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }

      + template {
          + max_replicas    = 2
          + min_replicas    = 1
          + revision_suffix = (known after apply)

          + container {
              + cpu               = 0.5
              + ephemeral_storage = (known after apply)
              + image             = "ecodevacr.azurecr.io/order-service:v0.1.0"
              + memory            = "1Gi"
              + name              = "eco-dev-order-service"

              + env {
                  + name  = "CONFIG_SERVER_URL"
                  + value = "https://cloud-config.dev.internal"
                }
              + env {
                  + name  = "SPRING_PROFILES_ACTIVE"
                  + value = "dev"
                }
            }
        }
    }

  # module.container_apps["payment-service"].azurerm_container_app.this will be created
  + resource "azurerm_container_app" "this" {
      + container_app_environment_id  = (known after apply)
      + custom_domain_verification_id = (sensitive value)
      + id                            = (known after apply)
      + latest_revision_fqdn          = (known after apply)
      + latest_revision_name          = (known after apply)
      + location                      = (known after apply)
      + name                          = "eco-dev-payment-service"
      + outbound_ip_addresses         = (known after apply)
      + resource_group_name           = "eco-dev-rg"
      + revision_mode                 = "Single"
      + tags                          = {
          + "Environment" = "dev"
          + "Owner"       = "platform-team"
          + "Project"     = "ecommerce-microservices"
        }

      + ingress {
          + allow_insecure_connections = false
          + external_enabled           = false
          + fqdn                       = (known after apply)
          + target_port                = 8084
          + transport                  = "auto"

          + traffic_weight {
              + latest_revision = true
              + percentage      = 100
            }
        }

      + registry {
          + password_secret_name = "acr-password"
          + server               = "ecodevacr.azurecr.io"
          + username             = "ecodevacr"
        }

      + secret {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }

      + template {
          + max_replicas    = 2
          + min_replicas    = 1
          + revision_suffix = (known after apply)

          + container {
              + cpu               = 0.5
              + ephemeral_storage = (known after apply)
              + image             = "ecodevacr.azurecr.io/payment-service:v0.1.0"
              + memory            = "1Gi"
              + name              = "eco-dev-payment-service"

              + env {
                  + name  = "CONFIG_SERVER_URL"
                  + value = "https://cloud-config.dev.internal"
                }
              + env {
                  + name  = "SPRING_PROFILES_ACTIVE"
                  + value = "dev"
                }
            }
        }
    }

  # module.container_apps["product-service"].azurerm_container_app.this will be created
  + resource "azurerm_container_app" "this" {
      + container_app_environment_id  = (known after apply)
      + custom_domain_verification_id = (sensitive value)
      + id                            = (known after apply)
      + latest_revision_fqdn          = (known after apply)
      + latest_revision_name          = (known after apply)
      + location                      = (known after apply)
      + name                          = "eco-dev-product-service"
      + outbound_ip_addresses         = (known after apply)
      + resource_group_name           = "eco-dev-rg"
      + revision_mode                 = "Single"
      + tags                          = {
          + "Environment" = "dev"
          + "Owner"       = "platform-team"
          + "Project"     = "ecommerce-microservices"
        }

      + ingress {
          + allow_insecure_connections = false
          + external_enabled           = false
          + fqdn                       = (known after apply)
          + target_port                = 8082
          + transport                  = "auto"

          + traffic_weight {
              + latest_revision = true
              + percentage      = 100
            }
        }

      + registry {
          + password_secret_name = "acr-password"
          + server               = "ecodevacr.azurecr.io"
          + username             = "ecodevacr"
        }

      + secret {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }

      + template {
          + max_replicas    = 2
          + min_replicas    = 1
          + revision_suffix = (known after apply)

          + container {
              + cpu               = 0.5
              + ephemeral_storage = (known after apply)
              + image             = "ecodevacr.azurecr.io/product-service:v0.1.0"
              + memory            = "1Gi"
              + name              = "eco-dev-product-service"

              + env {
                  + name  = "CONFIG_SERVER_URL"
                  + value = "https://cloud-config.dev.internal"
                }
              + env {
                  + name  = "SPRING_PROFILES_ACTIVE"
                  + value = "dev"
                }
            }
        }
    }

  # module.container_apps["service-discovery"].azurerm_container_app.this will be created
  + resource "azurerm_container_app" "this" {
      + container_app_environment_id  = (known after apply)
      + custom_domain_verification_id = (sensitive value)
      + id                            = (known after apply)
      + latest_revision_fqdn          = (known after apply)
      + latest_revision_name          = (known after apply)
      + location                      = (known after apply)
      + name                          = "eco-dev-service-discovery"
      + outbound_ip_addresses         = (known after apply)
      + resource_group_name           = "eco-dev-rg"
      + revision_mode                 = "Single"
      + tags                          = {
          + "Environment" = "dev"
          + "Owner"       = "platform-team"
          + "Project"     = "ecommerce-microservices"
        }

      + ingress {
          + allow_insecure_connections = false
          + external_enabled           = false
          + fqdn                       = (known after apply)
          + target_port                = 8761
          + transport                  = "auto"

          + traffic_weight {
              + latest_revision = true
              + percentage      = 100
            }
        }

      + registry {
          + password_secret_name = "acr-password"
          + server               = "ecodevacr.azurecr.io"
          + username             = "ecodevacr"
        }

      + secret {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }

      + template {
          + max_replicas    = 2
          + min_replicas    = 1
          + revision_suffix = (known after apply)

          + container {
              + cpu               = 0.5
              + ephemeral_storage = (known after apply)
              + image             = "ecodevacr.azurecr.io/service-discovery:v0.1.0"
              + memory            = "1Gi"
              + name              = "eco-dev-service-discovery"

              + env {
                  + name  = "CONFIG_SERVER_URL"
                  + value = "https://cloud-config.dev.internal"
                }
              + env {
                  + name  = "SPRING_PROFILES_ACTIVE"
                  + value = "dev"
                }
            }
        }
    }

  # module.container_apps["shipping-service"].azurerm_container_app.this will be created
  + resource "azurerm_container_app" "this" {
      + container_app_environment_id  = (known after apply)
      + custom_domain_verification_id = (sensitive value)
      + id                            = (known after apply)
      + latest_revision_fqdn          = (known after apply)
      + latest_revision_name          = (known after apply)
      + location                      = (known after apply)
      + name                          = "eco-dev-shipping-service"
      + outbound_ip_addresses         = (known after apply)
      + resource_group_name           = "eco-dev-rg"
      + revision_mode                 = "Single"
      + tags                          = {
          + "Environment" = "dev"
          + "Owner"       = "platform-team"
          + "Project"     = "ecommerce-microservices"
        }

      + ingress {
          + allow_insecure_connections = false
          + external_enabled           = false
          + fqdn                       = (known after apply)
          + target_port                = 8085
          + transport                  = "auto"

          + traffic_weight {
              + latest_revision = true
              + percentage      = 100
            }
        }

      + registry {
          + password_secret_name = "acr-password"
          + server               = "ecodevacr.azurecr.io"
          + username             = "ecodevacr"
        }

      + secret {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }

      + template {
          + max_replicas    = 2
          + min_replicas    = 1
          + revision_suffix = (known after apply)

          + container {
              + cpu               = 0.5
              + ephemeral_storage = (known after apply)
              + image             = "ecodevacr.azurecr.io/shipping-service:v0.1.0"
              + memory            = "1Gi"
              + name              = "eco-dev-shipping-service"

              + env {
                  + name  = "CONFIG_SERVER_URL"
                  + value = "https://cloud-config.dev.internal"
                }
              + env {
                  + name  = "SPRING_PROFILES_ACTIVE"
                  + value = "dev"
                }
            }
        }
    }

  # module.container_apps["user-service"].azurerm_container_app.this will be created
  + resource "azurerm_container_app" "this" {
      + container_app_environment_id  = (known after apply)
      + custom_domain_verification_id = (sensitive value)
      + id                            = (known after apply)
      + latest_revision_fqdn          = (known after apply)
      + latest_revision_name          = (known after apply)
      + location                      = (known after apply)
      + name                          = "eco-dev-user-service"
      + outbound_ip_addresses         = (known after apply)
      + resource_group_name           = "eco-dev-rg"
      + revision_mode                 = "Single"
      + tags                          = {
          + "Environment" = "dev"
          + "Owner"       = "platform-team"
          + "Project"     = "ecommerce-microservices"
        }

      + ingress {
          + allow_insecure_connections = false
          + external_enabled           = false
          + fqdn                       = (known after apply)
          + target_port                = 8700
          + transport                  = "auto"

          + traffic_weight {
              + latest_revision = true
              + percentage      = 100
            }
        }

      + registry {
          + password_secret_name = "acr-password"
          + server               = "ecodevacr.azurecr.io"
          + username             = "ecodevacr"
        }

      + secret {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }

      + template {
          + max_replicas    = 2
          + min_replicas    = 1
          + revision_suffix = (known after apply)

          + container {
              + cpu               = 0.5
              + ephemeral_storage = (known after apply)
              + image             = "ecodevacr.azurecr.io/user-service:v0.1.0"
              + memory            = "1Gi"
              + name              = "eco-dev-user-service"

              + env {
                  + name  = "CONFIG_SERVER_URL"
                  + value = "https://cloud-config.dev.internal"
                }
              + env {
                  + name  = "SPRING_PROFILES_ACTIVE"
                  + value = "dev"
                }
            }
        }
    }

  # module.container_apps_env.azurerm_container_app_environment.this will be created
  + resource "azurerm_container_app_environment" "this" {
      + custom_domain_verification_id    = (known after apply)
      + default_domain                   = (known after apply)
      + docker_bridge_cidr               = (known after apply)
      + id                               = (known after apply)
      + infrastructure_subnet_id         = "/subscriptions/079ab1f2-9528-44da-ba22-d60a88fdb0b8/resourceGroups/eco-dev-rg/providers/Microsoft.Network/virtualNetworks/eco-dev-vnet/subnets/eco-dev-apps-snet"
      + internal_load_balancer_enabled   = false
      + location                         = "eastus"
      + log_analytics_workspace_id       = "/subscriptions/079ab1f2-9528-44da-ba22-d60a88fdb0b8/resourceGroups/eco-dev-rg/providers/Microsoft.OperationalInsights/workspaces/eco-dev-law"
      + mutual_tls_enabled               = false
      + name                             = "eco-dev-aca-env"
      + platform_reserved_cidr           = (known after apply)
      + platform_reserved_dns_ip_address = (known after apply)
      + resource_group_name              = "eco-dev-rg"
      + static_ip_address                = (known after apply)
      + tags                             = {
          + "Environment" = "dev"
          + "Owner"       = "platform-team"
          + "Project"     = "ecommerce-microservices"
        }
      + zone_redundancy_enabled          = false
    }

Plan: 12 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + aks_cluster_id                 = (known after apply)
  + aks_kube_config                = (sensitive value)
  + aks_kubelet_identity_object_id = (known after apply)
  + container_app_fqdns            = {
      + api-gateway       = (known after apply)
      + cloud-config      = (known after apply)
      + favourite-service = (known after apply)
      + order-service     = (known after apply)
      + payment-service   = (known after apply)
      + product-service   = (known after apply)
      + service-discovery = (known after apply)
      + shipping-service  = (known after apply)
      + user-service      = (known after apply)
    }

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"

```

</details>

*Pusher: @Nicolas-CM, Action: `pull_request`, Workflow: `Infrastructure DEV - Terraform`*